[
  {
    "id": "3M",
    "title": "A Proud Moment: Dallas Trading Co. LLC Honored with the 3M Best Award",
    "tagline": "Dallas Trading Co. LLC recognized with the 3M Best Award for outstanding contribution to the 3M Electrical Market Business for 2024",
    "date": "2025-04-15",
    "content": "At Dallas Trading Co. LLC, moments like these remind us why dedication, collaboration, and trust truly matter.\n\nWe are proud to share that our long-standing partner, 3M, has recognized Dallas Trading Co. LLC with the 3M Best Award for our outstanding contribution to the 3M Electrical Market Business for 2024.\n\nThe recognition was presented during a special ceremony in Dubai, where our leadership team — Mr. Jay Ahuja (Executive Director), Mr. Vijay Ahuja (Director – Oman Operations), and Mr. Amjad Ali (General Manager) — had the privilege of accepting the award on behalf of our entire organization.\n\nThis honor is more than a milestone; it reflects the strength of our partnership with 3M and our shared vision of driving innovation, reliability, and growth in the electrical market. Behind every achievement stands a dedicated team, supportive partners, and loyal customers — and this recognition belongs to all of them.\n\nWe extend our sincere gratitude to 3M for this acknowledgment and to every member of the Dallas Trading family for their relentless commitment to excellence. Together, we continue to power progress and build a brighter, more connected future.",
    "images": ["3M_1.jpeg", "3M_2.jpeg", "3M_3.jpeg", "3M_4.jpeg"],
    "mainImage": "3M_1.jpeg"
  },
  {
    "id": "Barton",
    "title": "Strengthening Partnerships Through Knowledge | Barton Engineering x Dallas Trading Co. LLC",
    "tagline": "Engaging product training session strengthens partnership and technical expertise",
    "date": "2025-09-10",
    "content": "We had the pleasure of hosting our valued principal supplier, Barton Engineering, at our Dubai warehouse for an engaging and hands-on product training session!\n\nLed by Mr. Rajnish Kapoor (Chief Operating Officer), the Barton team — including Mr. Sayed Muntajibuddin, Mr. Shivaraj U.B, Mr. Abdul Kadhar, Mr. Teddy Bretana, and Mr. Patrick Manzano — brought a wealth of expertise and enthusiasm to the session.\n\nWelcomed by our General Manager, Mr. Amjad Ali, and the Dallas Trading Co. team, the day was filled with collaboration, learning, and practical demonstrations focused on:\n⚙ Enhancing technical know-how of Barton's conduit and cable management systems\n🔍 Understanding quality testing and global product standards\n💪 Live conduit bending demos showcasing Barton's product strength and durability\n\nWe're truly grateful to the Barton Engineering team for their time, insights, and commitment to empowering our people. Sessions like these strengthen our partnership and enable us to deliver even greater value and technical excellence to our customers.\n\nHere's to continuous learning, collaboration, and growth together! 🌟",
    "images": ["Barton_1.jpeg", "Barton_2.jpeg", "Barton_3.jpeg", "Barton_4.jpeg", "Barton_5.jpeg"],
    "mainImage": "Barton_1.jpeg"
  },
  {
    "id": "PCE",
    "title": "Strengthening Partnerships at Middle East Energy (MEE) 2025 – Dubai",
    "tagline": "Dallas Trading Co. LLC reconnects with PCE Austria at MEE 2025 to strengthen collaboration and explore new opportunities",
    "date": "2025-04-05",
    "content": "There's something special about meeting long-time partners face-to-face — especially in an environment buzzing with innovation and opportunity.\n\nAt Middle East Energy (MEE) 2025, held at the Dubai World Trade Centre, the Dallas Trading Co. LLC team had the pleasure of reconnecting with our valued principal partner, PCE Austria.\n\nRepresented by Mr. Jay Ahuja (Executive Director), Mr. Vijay Ahuja (Director – Oman), Mr. Amjad Ali (General Manager), and Mr. Navjot (Sales Manager – Bahrain), the Dallas team visited the PCE Austria booth to discuss new ideas, strengthen collaboration, and explore ways to expand our shared footprint in the energy and electrical sectors.\n\nIt was an inspiring exchange — a reflection of the strong relationship built over years of mutual trust and growth.\n\nHere's to continued success and new milestones together with PCE Austria!",
    "images": ["PCE_1.jpeg", "PCE_2.jpeg"],
    "mainImage": "PCE_1.jpeg"
  },
  {
    "id": "Ramadan2025",
    "title": "Ramadan Celebration with the Dallas Team",
    "tagline": "Celebrating Ramadan with the Dallas Team",
    "date": "2025-03-28",
    "content": "The holy month of Ramadan is a time for reflection, togetherness, and gratitude. Dallas Trading Co. LLC marked this special occasion with a warm and joyous Ramadan celebration attended by our leadership and team members.\n\nThe event was graced by the presence of Mr. Prakash Ahuja (Chairman), Mr. Jay Ahuja (Executive Director), Mr. Vijay Ahuja (Director – Oman Operations), and Mr. Amjad Ali (General Manager), along with team members from various departments.\n\nIt was a wonderful evening filled with heartfelt conversations, laughter, and the spirit of unity that defines the Dallas family.",
    "images": ["Ramadan2025_1.jpeg", "Ramadan2025_2.jpeg"],
    "mainImage": "Ramadan2025_1.jpeg"
  }
]
